; domain
(define (domain robotwaiter)
  (:requirements :strips :typing :negative-preconditions)

    (:types dish location table)

    (:predicates
    (robot-at ?a - location)                           ; robot is at location ?a
    (adjacent ?a1 - location ?a2 - location)           ; locations ?a1 and ?a2 are adjacent
    (dish-at ?d - dish ?a - location)                  ; dish ?d is at location ?a
    (carrying ?d - dish)                               ; robot is carrying dish ?d
    (free-hands)                                       ; robot's hands are free
    (table-at ?t - table ?a - location)                ; table ?t is at location ?a
    (order-at ?d - dish ?t - table)                    ; dish ?d is ordered at table ?t
    (served ?t - table)                                ; table ?t has been served
    )

  ; MOVE: robot walks from one area to an adjacent area.
  (:action move
    :parameters (?from - location ?to - location)
    :precondition (and
      (robot-at ?from)                          ; robot at area
      (adjacent ?from ?to)                      ; destination its adjacent to "from"
    )
    :effect (and
      (NOT (robot-at ?from))                    ; from has no robot
      (robot-at ?to)                            ; robot at destination
    )
  )

  (:action pick-up
      :parameters (?d - dish ?a - location)
      :precondition (and 
                    (robot-at ?a)
                    (dish-at ?d ?a)
                    (free-hands)
                    )
      :effect (and 
              (carrying ?d)
              (NOT (free-hands))
              (NOT (dish-at ?d ?a))
              )
  )

  (:action present-dish
      :parameters (?d - dish ?a - location ?t - table)
      :precondition (and 
                    (robot-at ?a)
                    (carrying ?d)
                    (table-at ?t ?a)
                    (order-at ?d ?t)
                    (NOT (served ?t))
                    )
      :effect (and 
              (served ?t)
              (NOT (carrying ?d))
              (free-hands)
              )
    )
)

; problem
(define (problem restaurant-delivery-simple)
  (:domain robotwaiter)
  
  (:objects
    ; Locations
    kitchen hall dr1 dr2 dr3 dr4 dr5 - location
    
    ; Dishes
    dish1 dish2 dish3 dish4 dish5 - dish
    
    ; Tables
    table1 table2 table3 table4 table5 - table
  )
  
  (:init
    ; Correct adjacencies based on the map
    (adjacent kitchen dr1)
    
    (adjacent dr1 kitchen)
    (adjacent dr1 dr3)
    (adjacent dr1 dr2)

    (adjacent dr2 dr1)
    (adjacent dr2 hall)

    (adjacent dr3 dr1)
    (adjacent dr3 dr4)
        
    (adjacent dr4 dr3)
    (adjacent dr4 dr5)

    (adjacent dr5 dr4)
    (adjacent dr5 hall)

    (adjacent hall dr2)
    (adjacent hall dr5)
    
    ; Initial state
    (robot-at hall)
    (dish-at dish1 kitchen)
    (dish-at dish2 kitchen)
    (dish-at dish3 kitchen)
    (dish-at dish4 kitchen)
    (dish-at dish5 kitchen)

    ;Tables
    (table-at table1 dr1)
    (table-at table2 dr2)
    (table-at table3 dr3)
    (table-at table4 dr4)
    (table-at table5 dr5)

    ; Order
    (order-at dish1 table1)
    (order-at dish2 table2)
    (order-at dish3 table3)
    (order-at dish4 table4)
    (order-at dish5 table5)

    (free-hands)
  )
  
  (:goal (and
    (served table1)
    (served table2)
    (served table3)
    (served table4)
    (served table5)
    (robot-at kitchen)
    )
  )
)

; plan
1. (move hall dr2)
   deleted: (robot-at hall)
   added: (robot-at dr2)
   goals met: 0 of 6
2. (move dr2 dr1)
   deleted: (robot-at dr2)
   added: (robot-at dr1)
   goals met: 0 of 6
3. (move dr1 kitchen)
   deleted: (robot-at dr1)
   added: (robot-at kitchen)
   goals met: 1 of 6
4. (pick-up dish1 kitchen)
   deleted: (free-hands) (dish-at dish1 kitchen)
   added: (carrying dish1)
   goals met: 1 of 6
5. (move kitchen dr1)
   deleted: (robot-at kitchen)
   added: (robot-at dr1)
   goals met: 0 of 6
6. (present-dish dish1 dr1 table1)
   deleted: (carrying dish1)
   added: (served table1) (free-hands)
   goals met: 1 of 6
7. (move dr1 kitchen)
   deleted: (robot-at dr1)
   added: (robot-at kitchen)
   goals met: 2 of 6
8. (pick-up dish2 kitchen)
   deleted: (free-hands) (dish-at dish2 kitchen)
   added: (carrying dish2)
   goals met: 2 of 6
9. (move kitchen dr1)
   deleted: (robot-at kitchen)
   added: (robot-at dr1)
   goals met: 1 of 6
10. (move dr1 dr2)
   deleted: (robot-at dr1)
   added: (robot-at dr2)
   goals met: 1 of 6
11. (present-dish dish2 dr2 table2)
   deleted: (carrying dish2)
   added: (served table2) (free-hands)
   goals met: 2 of 6
12. (move dr2 dr1)
   deleted: (robot-at dr2)
   added: (robot-at dr1)
   goals met: 2 of 6
13. (move dr1 kitchen)
   deleted: (robot-at dr1)
   added: (robot-at kitchen)
   goals met: 3 of 6
14. (pick-up dish3 kitchen)
   deleted: (free-hands) (dish-at dish3 kitchen)
   added: (carrying dish3)
   goals met: 3 of 6
15. (move kitchen dr1)
   deleted: (robot-at kitchen)
   added: (robot-at dr1)
   goals met: 2 of 6
16. (move dr1 dr3)
   deleted: (robot-at dr1)
   added: (robot-at dr3)
   goals met: 2 of 6
17. (present-dish dish3 dr3 table3)
   deleted: (carrying dish3)
   added: (served table3) (free-hands)
   goals met: 3 of 6
18. (move dr3 dr1)
   deleted: (robot-at dr3)
   added: (robot-at dr1)
   goals met: 3 of 6
19. (move dr1 kitchen)
   deleted: (robot-at dr1)
   added: (robot-at kitchen)
   goals met: 4 of 6
20. (pick-up dish4 kitchen)
   deleted: (free-hands) (dish-at dish4 kitchen)
   added: (carrying dish4)
   goals met: 4 of 6
21. (move kitchen dr1)
   deleted: (robot-at kitchen)
   added: (robot-at dr1)
   goals met: 3 of 6
22. (move dr1 dr3)
   deleted: (robot-at dr1)
   added: (robot-at dr3)
   goals met: 3 of 6
23. (move dr3 dr4)
   deleted: (robot-at dr3)
   added: (robot-at dr4)
   goals met: 3 of 6
24. (present-dish dish4 dr4 table4)
   deleted: (carrying dish4)
   added: (served table4) (free-hands)
   goals met: 4 of 6
25. (move dr4 dr3)
   deleted: (robot-at dr4)
   added: (robot-at dr3)
   goals met: 4 of 6
26. (move dr3 dr1)
   deleted: (robot-at dr3)
   added: (robot-at dr1)
   goals met: 4 of 6
27. (move dr1 kitchen)
   deleted: (robot-at dr1)
   added: (robot-at kitchen)
   goals met: 5 of 6
28. (pick-up dish5 kitchen)
   deleted: (free-hands) (dish-at dish5 kitchen)
   added: (carrying dish5)
   goals met: 5 of 6
29. (move kitchen dr1)
   deleted: (robot-at kitchen)
   added: (robot-at dr1)
   goals met: 4 of 6
30. (move dr1 dr2)
   deleted: (robot-at dr1)
   added: (robot-at dr2)
   goals met: 4 of 6
31. (move dr2 hall)
   deleted: (robot-at dr2)
   added: (robot-at hall)
   goals met: 4 of 6
32. (move hall dr5)
   deleted: (robot-at hall)
   added: (robot-at dr5)
   goals met: 4 of 6
33. (present-dish dish5 dr5 table5)
   deleted: (carrying dish5)
   added: (served table5) (free-hands)
   goals met: 5 of 6
34. (move dr5 dr4)
   deleted: (robot-at dr5)
   added: (robot-at dr4)
   goals met: 5 of 6
35. (move dr4 dr3)
   deleted: (robot-at dr4)
   added: (robot-at dr3)
   goals met: 5 of 6
36. (move dr3 dr1)
   deleted: (robot-at dr3)
   added: (robot-at dr1)
   goals met: 5 of 6
37. (move dr1 kitchen)
   deleted: (robot-at dr1)
   added: (robot-at kitchen)
   goals met: 6 of 6
